ХамелионЦРПТ/src/Enums/ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ/ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ</name>
  <enumValues>
    <name>Запуск</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Остановка</name>
  </enumValues>
</mdclass:Enum>

ХамелионЦРПТ/src/CommonModules/ОбщийМодуль_Выполнить_На_КЛИЕНТЕ_ХамелеонЦРПТ/Module.bsl
Процедура ОбработкаГлобальногоЗадания_ХамелеонЦРПТ() Экспорт
	
	ВремяПоследнегоВыполнения=Неопределено;
	ЗаданияВыполнитьНадоИВремя=ОбщийМодуль_ВЫПОЛНИТЬ_ВЫЗОВОМ_СЕРВЕРА_ХамелеонЦРПТ.ВернутьЗаданияИВремяВыполнения(ВремяПоследнегоВыполнения);
	Если ЗаданияВыполнитьНадоИВремя.Количество()>0 Тогда
		ТекДата=Текущаядата();
		Если НачалоДня(ВремяПоследнегоВыполнения)<>НачалоДня(ТекДата) Тогда
			ВремяПоследнегоВыполнения=Неопределено                                                       	
		Иначе
			ВремяПоследнегоВыполнения =  дата('00010101') + (ВремяПоследнегоВыполнения-НачалоДня(ВремяПоследнегоВыполнения));
		КонецЕсли;
		ТекущееВремя =  дата('00010101') + (ТекДата-НачалоДня(ТекДата));
		УжеВыполнили=Новый Массив;
		Для Каждого Стр_1_1 Из ЗаданияВыполнитьНадоИВремя ЦИкл
			Если Стр_1_1.Время<=ТекущееВремя И (Не ЗначениеЗАполнено(ВремяПоследнегоВыполнения) ИЛИ
				ВремяПоследнегоВыполнения<Стр_1_1.Время) Тогда
				Если УжеВыполнили.Найти(Стр_1_1.Тип)=Неопределено Тогда
					УжеВыполнили.Добавить(Стр_1_1.Тип);
				Иначе
					//УЖЕ ВЫПОЛНИЛИ
					Продолжить;
				КонецЕсли;
				
				
				Если Стр_1_1.НаКлиенте=Истина тогда
					
					Попытка
						ОбщийМодуль_ВЫПОЛНИТЬ_ВЫЗОВОМ_СЕРВЕРА_ХамелеонЦРПТ.ЗаписатьВЖурналРегламент(Стр_1_1.Наименование,Предопределенноезначение("Перечисление.ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ.Запуск"),"");
						Выполнить(Стр_1_1.Алгоритм);
						ОбщийМодуль_ВЫПОЛНИТЬ_ВЫЗОВОМ_СЕРВЕРА_ХамелеонЦРПТ.ЗаписатьВЖурналРегламент(Стр_1_1.Наименование,Предопределенноезначение("Перечисление.ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ.Остановка"),"");
					Исключение
						ОбщийМодуль_ВЫПОЛНИТЬ_ВЫЗОВОМ_СЕРВЕРА_ХамелеонЦРПТ.ЗаписатьВЖурналРегламент(Стр_1_1.Наименование,Предопределенноезначение("Перечисление.ТипЗапускаРегламентногоЗадания_ХамелеонЦРПТ.Ошибка"),ОписаниеОшибки());
					КонецПопытки;
				Иначе
					//Попытка
						ОбщийМодуль_ВЫПОЛНИТЬ_ВЫЗОВОМ_СЕРВЕРА_ХамелеонЦРПТ.ВыполнитьНаСервере(Стр_1_1.Тип);
					//исключение
					//КонецПопытки;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		ОбщийМодуль_ВЫПОЛНИТЬ_ВЫЗОВОМ_СЕРВЕРА_ХамелеонЦРПТ.УстановитьДатуВремя(ТекДата);
	КонецЕсли;
КонецПроцедуры


Процедура ВыполнитьРегламентНаКлиенте_ХамелеонЦРПТ(Алгоритм) Экспорт
	ВремяПоследнегоВыполнения=Неопределено;
	ЗаданияВыполнитьНадоИВремя=ОбщийМодуль_ВЫПОЛНИТЬ_ВЫЗОВОМ_СЕРВЕРА_ХамелеонЦРПТ.ВернутьЗаданияИВремяВыполнения(ВремяПоследнегоВыполнения);
	Выполнить(Алгоритм);
	
КонецПроцедуры
